Repository: Pierre-Lannoy/wp-keys-master
Catalog: .translations/wp-plugins-keys-master-stable-readme-*.po
Languages: fr

source: Powerful application passwords manager for WordPress with role-based usage control and full analytics reporting capabilities.
fr: Puissant gestionnaire de mots de passe d’application pour WordPress avec contrôle d’utilisation basé sur les rôles et fonctionnalités complètes de statistiques d’usage.

source: For a full help on WP-CLI commands in Keys Master, please <a href="https://github.com/Pierre-Lannoy/wp-keys-master/blob/master/WP-CLI.md">read this guide</a>.
fr: Pour obtenir une aide complète sur les commandes WP-CLI dans Keys Master, veuillez <a href="https://github.com/Pierre-Lannoy/wp-keys-master/blob/master/WP-CLI.md">lire ce guide</a>.

source: <strong>Keys Master</strong> supports a set of WP-CLI commands to:
fr: <strong>Keys Master</strong> prend en charge un ensemble de commandes WP-CLI pour :

source: display passwords statistics - see <code>wp help apwd analytics</code> for details.
fr: afficher les statistiques de mots de passe - voir <code>wp help apwd analytics</code> pour plus de détails.

source: modify operations mode - see <code>wp help apwd mode</code> for details;
fr: modifier le mode de fonctionnement - voir <code>wp help apwd mode</code> pour plus de détails ;

source: toggle on/off main settings - see <code>wp help apwd settings</code> for details;
fr: activer ou désactiver le réglages principaux - voir <code>wp help apwd settings</code> pour plus de détails ;

source: manage WordPress application passwords (list, create and revoke) - see <code>wp help apwd password</code> for details;
fr: gérer les mots de passe d’application WordPress (lister, créer et révoquer) - voir <code>wp help apwd password</code> pour plus de détails ;

source: Application Passwords Options Per Roles
fr: Options des mots de passe d’application par rôle

source: You can report bugs and suggest ideas via the <a href="https://github.com/Pierre-Lannoy/wp-keys-master/issues">GitHub issue tracker</a> of the plugin.
fr: Vous pouvez signaler des bogues et suggérer des améliorations via le <a href="https://github.com/Pierre-Lannoy/wp-keys-master/issues">suivi d’incidents GitHub</a> de l’extension.

source: Support is provided via the official <a href="https://wordpress.org/support/plugin/keys-master/">WordPress page</a>.
fr: L’assistance est proposée via la page officielle <a href="https://wordpress.org/support/plugin/keys-master/">d’assistance</a>.

source: Yes. It is designed to work on multisite too. Network Admins can use all the plugin features. Sites Admins have no access to the plugin features.
fr: Oui. Cette extension est conçue pour fonctionner sur un multisite aussi. Les administratrices et administrateurs du réseau peuvent configurer l’extension et avoir accès à toutes fonctionnalités. Les administratrices et administrateurs de sites n’ont, eux, accès à aucune fonctionnalité.

source: You need at least <strong>WordPress 5.6</strong> and <strong>PHP 7.2</strong>.
fr: Vous avez besoin d’au moins <strong>WordPress 5.6</strong> et <strong>PHP 7.2</strong>.

source: Where can I report a bug?
fr: Où puis-je signaler un bogue ?

source: Where can I get support?
fr: Où puis-je obtenir de l’aide ?

source: Can this plugin work on multisite?
fr: Cette extension fonctionne-t’elle sur un multisite ?

source: What are the requirements for this plugin to work?
fr: Quels sont les prérequis pour que cette extension fonctionne ?

source: Enjoy!
fr: Profitez !

source: Visit 'PerfOps Settings &gt; Keys Master' in the left-hand menu of your WP Admin to adjust settings.
fr: Visitez « Réglages PerfOps > Keys Master » dans le menu gauche de votre panneau d’administration pour ajuster les paramètres.

source: Activate Keys Master from your Plugins page.
fr: Activez Keys Master depuis votre page Extensions.

source: Upload the <code>keys-master</code> directory to your <code>/wp-content/plugins/</code> directory, using your favorite method (ftp, sftp, scp, etc...).
fr: Téléversez le dossier <code>keys-master</code> dans votre dossier <code>/wp-content/plugins/</code>, en utilisant votre méthode préférée (ftp, sftp, scp, etc.).

source: Download Keys Master.
fr: Téléchargez Keys Master.

source: Activate Keys Master.
fr: Activez Keys Master.

source: Click on the 'Install Now' button.
fr: Cliquez sur le bouton « Installer maintenant ».

source: Search for 'Keys Master'.
fr: Cherchez « Keys Master ».

source: Visit 'Plugins &gt; Add New'.
fr: Visitez « Extensions &gt; Ajouter ».

source: Once Activated
fr: Une fois activé

source: From WordPress.org
fr: Depuis WordPress.org

source: From your WordPress dashboard
fr: Depuis votre Tableau de bord WordPress

source: If you like this plugin or find it useful and want to thank me for the work done, please consider making a donation to <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> or the <a href="https://www.eff.org/">Electronic Frontier Foundation</a> which are advocacy groups defending the rights and freedoms of citizens on the Internet. By supporting them, you help the daily actions they perform to defend our fundamental freedoms!
fr: Si vous aimez cette extension ou la trouvez utile et que vous voulez me remercier pour le travail accompli, vous pouvez faire un don à <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> ou l’<a href="https://www.eff.org/">Electronic Frontier Foundation</a> qui sont des associations de défense des droits et libertés des citoyens sur Internet. En les soutenant, vous aidez les actions quotidiennes qu’ils accomplissent pour défendre nos libertés fondamentales !

source: This plugin doesn't handle personally identifiable information (PII).
fr: Cette extension ne traite pas de données à caractère personnel (DCP).

source: This plugin doesn't set any cookie in the user's browser.
fr: Cette extension ne dépose pas de cookie dans le navigateur de l’utilisatrice ou de l’utilisateur.

source: This plugin, as any piece of software, is neither compliant nor non-compliant with privacy laws and regulations. It is your responsibility to use it - by activating the corresponding options or services - with respect for the personal data of your users and applicable laws.
fr: Cette extension, comme tout autre logiciel, n’est ni conforme ni non conforme aux lois et règlements sur la protection de la vie privée. Il est de votre responsabilité de l’utiliser - en activant les options ou services correspondants - dans le respect des données personnelles de vos utilisatrices et utilisateurs ainsi que des lois applicables.

source: Anyway, I'll be glad to help you if you encounter issues when using this plugin. Just use the support section of this plugin page.
fr: Dans tous les cas, je serai heureux de vous apporter mon assistance si vous rencontrez des problèmes lors de l’utilisation de cette extension. Merci de me contacter via la page support de ce site.

source: This plugin is free and provided without warranty of any kind. Use it at your own risk, I'm not responsible for any improper use of this plugin, nor for any damage it might cause to your site. Always backup all your data before installing a new plugin.
fr: Cette extension est gratuite et distribuée sans aucune garantie d’aucune sorte. Son utilisation se fait à vos risques et périls, je ne saurais être tenu responsable d’aucun dommage que son utilisation pourrait causer à votre site. Pensez à toujours sauvegarder vos données avant d’installer une nouvelle extension.

source: <strong>Keys Master</strong> is a free and open source plugin for WordPress. It integrates many other free and open source works (as-is or modified). Please, see 'about' tab in the plugin settings to see the details.
fr: <strong>Keys Master</strong> est une extensions libre et open source pour WordPress. Elle intègre de nombreuses autres œuvres libres et open source (telles quelles ou modifiées). Consultez l’onglet « à propos » dans l’extension pour obtenir des détails.

source: <strong>Keys Master</strong> can report the following main items and metrics:
fr: <strong>Keys Master</strong> peut rendre compte des métriques et éléments principaux suivants :

source: For each roles defined on your site, you can define a period during which a password can be unused before auto-revocation.
fr: Pour chaque rôle défini sur votre site, vous pouvez définir une période pendant laquelle un mot de passe peut rester inutilisé avant révocation automatique.

source: You can limit usage of application passwords, on a per role basis:
fr: Vous pouvez limiter l’utilisation des mots de passe d’application, par rôle :

source: <strong>Keys Master</strong> is a powerful application passwords manager for WordPress with role-based usage control and full analytics reporting about passwords usages. It relies on the "application password" core feature introduced in WordPress 5.6. and add it extra features and controls.
fr: <strong>Keys Master</strong> est un puissant gestionnaire de mots de passe d’application pour WordPress avec un contrôle d’utilisation basé sur les rôles et des fonctionnalités complètes de statistiques d’usage. Il s’appuie sur la fonctionnalité native « mot de passe d’application » introduite dans WordPress 5.6. et lui ajoute des fonctionnalités et des contrôles supplémentaires.

source: site breakdowns in multisites environments.
fr: répartition par sites dans les environnements multisites.

source: countries breakdown (requires the free <a href="https://wordpress.org/plugins/ip-locator/">IP Locator</a> plugin);
fr: répartition par pays (nécessite l’extension gratuite <a href="https://wordpress.org/plugins/ip-locator/">IP Locator</a>) ;

source: clients breakdown (requires the free <a href="https://wordpress.org/plugins/device-detector/">Device Detector</a> plugin);
fr: répartition par clients (nécessite l’extension gratuite <a href="https://wordpress.org/plugins/device-detector/">Device Detector</a>) ;

source: channels breakdown;
fr: répartition par canaux ;

source: KPIs: authentication success, number, creations and revocations of passwords, adoption and usage rate;
fr: Indicateurs clés de performance : succès d’authentification, nombre, créations et révocations de mots de passe, taux d’adoption et d’utilisation ;

source: specific usage: none (blocks usage), only authentication and revocation or full management (with password creation).
fr: utilisation spécifique : aucune (bloque l’utilisation), seulement l’authentification et la révocation ou la gestion complète (avec création de mot de passe).

source: maximum passwords per user;
fr: nombre maximum de mots de passe par compte ;

source: Donation
fr: Don

source: Privacy
fr: Confidentialité

source: Support
fr: Assistance

source: Plugin Options
fr: Options de l’extension

source: Main Analytics Dashboard
fr: Tableau de bord analytique principal

source: Application Passwords Management
fr: Gestion des mots de passe d’application

source: Please, see <a href="https://github.com/Pierre-Lannoy/wp-keys-master/blob/master/CHANGELOG.md">full changelog</a> on GitHub.
fr: Merci de consulter le <a href="https://github.com/Pierre-Lannoy/wp-keys-master/blob/master/CHANGELOG.md">journal des modifications</a> sur GitHub.
